Revit 2024 API
RevitLinkType.UpdateFromIFC Method
Overload List
Name | Description
UpdateFromIFC(Document, ExternalResourceReference, String, Boolean)
 Updates a Revit link type from an IFC file and loads the linked document.
UpdateFromIFC(Document, String, String, Boolean)
 Updates a Revit link type from an IFC file and loads the linked document.
See Also
RevitLinkType Class
RevitLinkType Members
Autodesk.Revit.DB Namespace